meeting/agenda/2024/01-16.org
:PROPERTIES:
:ID:       7799FEC3-E594-4811-80A4-D97E26F94938
:END:
#+title: QT4 CG Meeting 061 Agenda 2024-01-16
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/01-09.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 16 January. The following meeting is
scheduled for 23 January.

Any regrets for 23 January 2024?

** Review of open action items [2/10]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”
+ [ ] QT4CG-052-06: MK to consider the editorial question of “promotion” for the symmetric relations.
+ [ ] QT4CG-055-01: MK to clarify that the return type of the deep lookup operator is a flat sequence.
+ [ ] QT4CG-056-04: MK to write a proposal for adding a select attribute to xsl:text
+ [ ] QT4CG-058-01: MK to clarify in ~fn:numeric-compare~ that -0 and +0 are equal.
+ [ ] QT4CG-058-02: MK to consider providing more advice about the pitfalls of mixing decimal and double when sorting
+ [X] QT4CG-060-01: NW to describe why we’re closing #899 without change
+ [ ] QT4CG-060-02: MK to sketch out a proposal with ~subsequence~ and ~subsequence-where~.
+ [ ] QT4CG-060-03: MK to review PR and if there are no concerns, merge it without discussion next weeks
+ [X] QT4CG-060-04: CG to make a PR to remove ~numeric-compare~ and consider other functions

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-795][#795]]: 655: fn:sort-with
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528: revision of json(), and renaming to elements-to-maps()

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-947][#947]]: Reorganise F+O chapter 15 [editorial]
+ PR [[https://qt4cg.org/dashboard/#pr-942][#942]]: 530 Fix typo, escape-solidus not escape-uri-attributes
+ PR [[https://qt4cg.org/dashboard/#pr-933][#933]]: 930 drop obsolete note about comments and PIs
+ PR [[https://qt4cg.org/dashboard/#pr-932][#932]]: 931 Add rules for duration precision
+ PR [[https://qt4cg.org/dashboard/#pr-928][#928]]: Minor edits through ch. 15
+ PR [[https://qt4cg.org/dashboard/#pr-737][#737]]: 295: Boost the capability of recursive record types

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-871][#871]]: Action qt4 cg 027 01 next match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-943][#943]]: 187 Add FLWOR expression while clause
+ PR [[https://qt4cg.org/dashboard/#pr-941][#941]]: 939 Remove fn:numeric-compare
+ PR [[https://qt4cg.org/dashboard/#pr-940][#940]]: 878 Add subsequence-where function
+ PR [[https://qt4cg.org/dashboard/#pr-937][#937]]: 779 hash function
+ PR [[https://qt4cg.org/dashboard/#pr-936][#936]]: 877 revised rules for op:binary-less-than
+ PR [[https://qt4cg.org/dashboard/#pr-927][#927]]: 861 Rewrite spec of deep lookup operator
+ PR [[https://qt4cg.org/dashboard/#pr-921][#921]]: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch
+ PR [[https://qt4cg.org/dashboard/#pr-916][#916]]: 720 Allow methods in maps with access to $this
+ PR [[https://qt4cg.org/dashboard/#pr-880][#880]]: 872 Symmetry: fn:items-at → fn:get
+ PR [[https://qt4cg.org/dashboard/#pr-874][#874]]: 878 Proposed extension to subsequence
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/937][#937]]: 779 hash function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/910][#910]]: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/908][#908]]: Function identity: documentation still too vague
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/829][#829]]: fn:boolean: EBV support for more item types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/557][#557]]: fn:unparsed-binary: accessing and manipulating binary types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]]: fn:format-number: Specifying decimal format
+ Issue [[https://github.com/qt4cg/qtspecs/issues/283][#283]]: Enumeration types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/260][#260]]: array:index-of
+ Issue [[https://github.com/qt4cg/qtspecs/issues/236][#236]]: map:group-by or map:build with a sequence of keys
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: json parsing number type option
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #927: 861 Rewrite spec of deep lookup operator
:PROPERTIES:
:CUSTOM_ID: pr-927
:END:

See PR [[https://qt4cg.org/dashboard/#pr-927][#927]]


** PR #916: 720 Allow methods in maps with access to $this
:PROPERTIES:
:CUSTOM_ID: pr-916
:END:

See PR [[https://qt4cg.org/dashboard/#pr-916][#916]]

** PR #832: 77 Add map:deep-update and array:deep-update
:PROPERTIES:
:CUSTOM_ID: pr-832
:END:

See PR [[https://qt4cg.org/dashboard/#pr-832][#832]]

** PR #943: 187 Add FLWOR expression while clause
:PROPERTIES:
:CUSTOM_ID: pr-943
:END:

See PR [[https://qt4cg.org/dashboard/#pr-943][#943]]

** PR #941: 939 Remove fn:numeric-compare
:PROPERTIES:
:CUSTOM_ID: pr-941
:END:

See PR [[https://qt4cg.org/dashboard/#pr-941][#941]]

** PR #940: 878 Add subsequence-where function
:PROPERTIES:
:CUSTOM_ID: pr-940
:END:

See PR [[https://qt4cg.org/dashboard/#pr-940][#940]]

** PR #937: 779 hash function
:PROPERTIES:
:CUSTOM_ID: pr-937
:END:

See PR [[https://qt4cg.org/dashboard/#pr-937][#937]]

** PR #936: 877 revised rules for op:binary-less-than
:PROPERTIES:
:CUSTOM_ID: pr-936
:END:

See PR [[https://qt4cg.org/dashboard/#pr-936][#936]]

** PR #880: 872 Symmetry: fn:items-at → fn:get
:PROPERTIES:
:CUSTOM_ID: pr-880
:END:

See PR [[https://qt4cg.org/dashboard/#pr-880][#880]]

See also discussion from [[https://qt4cg.org/meeting/minutes/2023/12-12.html#h-DC545309-6A5B-4A3C-AE70-132ABC98B442][meeting 058]] and [[https://qt4cg.org/meeting/minutes/2023/12-05.html#h-E01573AE-CAC0-43ED-94F6-05094B3AB8A1][meeting 57]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:


