meeting/agenda/2024/01-16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 061 Agenda 2024-01-16</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 061 Agenda 2024-01-16</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/01-09.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 16 January. The following meeting is
scheduled for 23 January.
</p>

<p>
Any regrets for 23 January 2024?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/10]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-06: MK to consider the editorial question of “promotion” for the symmetric relations.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-055-01: MK to clarify that the return type of the deep lookup operator is a flat sequence.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-056-04: MK to write a proposal for adding a select attribute to xsl:text</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-058-01: MK to clarify in <code>fn:numeric-compare</code> that -0 and +0 are equal.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-058-02: MK to consider providing more advice about the pitfalls of mixing decimal and double when sorting</li>
<li class="on"><code>[X]</code> QT4CG-060-01: NW to describe why we’re closing #899 without change</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-060-02: MK to sketch out a proposal with <code>subsequence</code> and <code>subsequence-where</code>.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-060-03: MK to review PR and if there are no concerns, merge it without discussion next weeks</li>
<li class="on"><code>[X]</code> QT4CG-060-04: CG to make a PR to remove <code>numeric-compare</code> and consider other functions</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-795">#795</a>: 655: fn:sort-with</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528: revision of json(), and renaming to elements-to-maps()</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-947">#947</a>: Reorganise F+O chapter 15 [editorial]</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-942">#942</a>: 530 Fix typo, escape-solidus not escape-uri-attributes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-933">#933</a>: 930 drop obsolete note about comments and PIs</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-932">#932</a>: 931 Add rules for duration precision</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-928">#928</a>: Minor edits through ch. 15</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-737">#737</a>: 295: Boost the capability of recursive record types</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.3.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-943">#943</a>: 187 Add FLWOR expression while clause</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-941">#941</a>: 939 Remove fn:numeric-compare</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-940">#940</a>: 878 Add subsequence-where function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-937">#937</a>: 779 hash function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-936">#936</a>: 877 revised rules for op:binary-less-than</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-927">#927</a>: 861 Rewrite spec of deep lookup operator</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-916">#916</a>: 720 Allow methods in maps with access to $this</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-880">#880</a>: 872 Symmetry: fn:items-at → fn:get</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-874">#874</a>: 878 Proposed extension to subsequence</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.5.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/937">#937</a>: 779 hash function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation still too vague</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/829">#829</a>: fn:boolean: EBV support for more item types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/583">#583</a>: array:replace(), etc</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/340">#340</a>: fn:format-number: Specifying decimal format</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/283">#283</a>: Enumeration types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/260">#260</a>: array:index-of</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/236">#236</a>: map:group-by or map:build with a sequence of keys</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/33">#33</a>: json parsing number type option</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-927" class="outline-3">
<h3 id="pr-927"><span class="section-number-3">2.1.</span> PR #927: 861 Rewrite spec of deep lookup operator</h3>
<div class="outline-text-3" id="text-pr-927">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-927">#927</a>
</p>
</div>
</div>


<div id="outline-container-pr-916" class="outline-3">
<h3 id="pr-916"><span class="section-number-3">2.2.</span> PR #916: 720 Allow methods in maps with access to $this</h3>
<div class="outline-text-3" id="text-pr-916">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-916">#916</a>
</p>
</div>
</div>

<div id="outline-container-pr-832" class="outline-3">
<h3 id="pr-832"><span class="section-number-3">2.3.</span> PR #832: 77 Add map:deep-update and array:deep-update</h3>
<div class="outline-text-3" id="text-pr-832">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>
</p>
</div>
</div>

<div id="outline-container-pr-943" class="outline-3">
<h3 id="pr-943"><span class="section-number-3">2.4.</span> PR #943: 187 Add FLWOR expression while clause</h3>
<div class="outline-text-3" id="text-pr-943">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-943">#943</a>
</p>
</div>
</div>

<div id="outline-container-pr-941" class="outline-3">
<h3 id="pr-941"><span class="section-number-3">2.5.</span> PR #941: 939 Remove fn:numeric-compare</h3>
<div class="outline-text-3" id="text-pr-941">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-941">#941</a>
</p>
</div>
</div>

<div id="outline-container-pr-940" class="outline-3">
<h3 id="pr-940"><span class="section-number-3">2.6.</span> PR #940: 878 Add subsequence-where function</h3>
<div class="outline-text-3" id="text-pr-940">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-940">#940</a>
</p>
</div>
</div>

<div id="outline-container-pr-937" class="outline-3">
<h3 id="pr-937"><span class="section-number-3">2.7.</span> PR #937: 779 hash function</h3>
<div class="outline-text-3" id="text-pr-937">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-937">#937</a>
</p>
</div>
</div>

<div id="outline-container-pr-936" class="outline-3">
<h3 id="pr-936"><span class="section-number-3">2.8.</span> PR #936: 877 revised rules for op:binary-less-than</h3>
<div class="outline-text-3" id="text-pr-936">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-936">#936</a>
</p>
</div>
</div>

<div id="outline-container-pr-880" class="outline-3">
<h3 id="pr-880"><span class="section-number-3">2.9.</span> PR #880: 872 Symmetry: fn:items-at → fn:get</h3>
<div class="outline-text-3" id="text-pr-880">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-880">#880</a>
</p>

<p>
See also discussion from <a href="https://qt4cg.org/meeting/minutes/2023/12-12.html#h-DC545309-6A5B-4A3C-AE70-132ABC98B442">meeting 058</a> and <a href="https://qt4cg.org/meeting/minutes/2023/12-05.html#h-E01573AE-CAC0-43ED-94F6-05094B3AB8A1">meeting 57</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>